# Date Night Movie

#### Grading:


- Code: 90 pts
- Markdown Documentation: 10 pts

Reagan Berhe
10/08/2020

In this assignment we are going to use pandas to figure out - What's the best **date-night movie**?

This assignment is going to use
- Joining
- Groupby
- Sorting

In [1]:
import os
import pandas as pd

##### Read in the movie data: `pd.read_table`

In [2]:
def get_movie_data():
    
    unames = ['user_id','gender','age','occupation','zip']
    users = pd.read_table(os.path.join('../data','users.dat'), 
                          sep='::', header=None, names=unames)
    
    rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
    ratings = pd.read_table(os.path.join('../data', 'ratings.dat'), 
                            sep='::', header=None, names=rnames)
    
    mnames = ['movie_id', 'title','genres']
    movies = pd.read_table(os.path.join('../data', 'movies.dat'), 
                           sep='::', header=None, names=mnames)

    return users, ratings, movies

In [3]:
users, ratings, movies = get_movie_data()

In [4]:
users.head()

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [5]:
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [6]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

##### Clean up the `movies`

- Get the `year`
- Shorten the `title`

In [7]:
tmp = movies.title.str.extract('(.*) \(([0-9]+)\)')
tmp.apply(lambda x:x[0] if len(x) > 0 else None)
tmp.apply(lambda x: x[0][:40] if len(x) > 0 else None)
tmp

                                0     1
0                       Toy Story  1995
1                         Jumanji  1995
2                Grumpier Old Men  1995
3               Waiting to Exhale  1995
4     Father of the Bride Part II  1995
...                           ...   ...
3878             Meet the Parents  2000
3879          Requiem for a Dream  2000
3880                    Tigerland  2000
3881             Two Family House  2000
3882               Contender, The  2000

[3883 rows x 2 columns]

In [8]:
movies['year'] = tmp[1]
movies['short_title'] = tmp[0]

In [9]:
movies.shape  #(3883,3)
movies

,movie_id,title,genres,year,short_title
0,1,Toy Story (1995),Animation|Children's|Comedy,1995,Toy Story
1,2,Jumanji (1995),Adventure|Children's|Fantasy,1995,Jumanji
2,3,Grumpier Old Men (1995),Comedy|Romance,1995,Grumpier Old Men
3,4,Waiting to Exhale (1995),Comedy|Drama,1995,Waiting to Exhale
4,5,Father of the Bride Part II (1995),Comedy,1995,Father of the Bride Part II
...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,2000,Meet the Parents
3879,3949,Requiem for a Dream (2000),Drama,2000,Requiem for a Dream
3880,3950,Tigerland (2000),Drama,2000,Tigerland
3881,3951,Two Family House (2000),Drama,2000,Two Family House
3882,3952,"Contender, The (2000)",Drama|Thriller,2000,"Contender, The"

##### Join the tables with `pd.merge` (10 pts)
## Merged table using pd.merge for dataset users, rateing, movies:

In [10]:
# Table merger using pd.merge twice for three table and used inner merger 
merged_tables = pd.merge(users,ratings, on='user_id', how= 'inner').merge(movies, on ='movie_id', how= 'inner')
merged_tables.head()

,user_id,gender,age,occupation,zip,movie_id,rating,timestamp,title,genres,year,short_title
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest

##### What's the highest rated movie? (10 pts))
## The highest 10 top rated movies are:

In [11]:
# Top rated movie according users rating. 
most_rated = merged_tables.groupby('title').size().sort_values(ascending = False)[:10]
most_rated

title
American Beauty (1999)                                   3428
Star Wars: Episode IV - A New Hope (1977)                2991
Star Wars: Episode V - The Empire Strikes Back (1980)    2990
Star Wars: Episode VI - Return of the Jedi (1983)        2883
Jurassic Park (1993)                                     2672
Saving Private Ryan (1998)                               2653
Terminator 2: Judgment Day (1991)                        2649
Matrix, The (1999)                                       2590
Back to the Future (1985)                                2583
Silence of the Lambs, The (1991)                         2578
dtype: int64

## Recomandation for rated movie for date night: 
# Top 10 Most Recommanded movie of all time: ...

In [12]:
# Year after 1995 
# age older than 18
# genres Drama

filtered_df = merged_tables[(merged_tables['year'] > '1995') & (merged_tables['age'] >= 18) & (merged_tables['genres'] == 'Drama')]
filtered_df.groupby('title').apply(lambda x:x['rating'].sum()).sort_values(ascending = False)[:10]

title
Good Will Hunting (1997)    6291
Fight Club (1999)           5674
Erin Brockovich (2000)      4894
Magnolia (1999)             4194
Boogie Nights (1997)        4162
Truman Show, The (1998)     3736
Elizabeth (1998)            3707
Insider, The (1999)         3474
Boys Don't Cry (1999)       3324
Trainspotting (1996)        2934
dtype: int64

###### What is a good rated movie for date night? (30 pts)

- Hint - highly rated movie by 
    - both partners (might be the same gender or not),
    - based on genre preferences,
    - age group can also be combined